/**
 * advice.js 显示体质测试项目练习建议JS
 * Created on 2018.11.10 by Jerry Cheung
 */

var adviceContent=[];
adviceContent["height"]="身高";
adviceContent["weight"]="1、低体重：请按照首页“健康膳食营养建议”的指引去饮食，不偏食、不挑食、不吃垃圾食品等，按时进餐，遵循好的作息时间，加强体育锻炼。<br>2、正常：保持良好的营养饮食习惯、好的作息时间与良好的锻炼习惯。<br>3、超重：保持均衡营养的基础上，晚餐减少进餐量，特别是减少糖类、脂肪类的摄入量，少吃或不吃垃圾食品、碳酸饮料等，尽量少吃或不吃宵夜，加强体育锻炼。<br>4、肥胖：保持基础营养的基础上，坚持减少进餐量，特别是晚餐，尽量少吃，吃晚餐不超过晚上8点，坚持不吃宵夜，不吃垃圾食品、碳酸饮料等，务必加强体育锻炼，特别是多做有氧运动，如30-40分钟以上的游泳、跑步、爬山等，同时加强体能练习，如力量练习等。";
adviceContent["vital_capacity"]="第一步是5秒钟的吸气：先慢慢地由鼻孔吸气，使横隔膜向下拉，腹部会鼓胀起来，接着继续吸气，将胸腔再扩大，肋骨上抬，胸部上挺，让肺部尽量多地吸入空气。<br>第二步是屏息，一般是5秒，随着练习的增加，屏息的时间可以增加，让肺部可以尽量多的吸收氧气；第三步是缓慢的吐气，胸腔和腹腔回复原来的状态。 三个步骤为一个练习小节，反复进行。吹气球，也可锻炼。";
adviceContent["stand_jump"]="1、摆臂深蹲：双脚分开与肩同宽，双体保持直立，下蹲时双臂后摆，脚跟紧贴地面，起身时上臂向上摆动，抬起脚跟，身体有向前上方跳起的趋势。进行2-3组，每组12-15次。<br>2、双脚连续障碍跳（或蛙跳）：15米，3组以上<br>3、跳台阶：15-20个台阶，3组以上<br>4、单脚跳：30米，左右脚各3组以上<br>5、收腹跳：每组10次，3组以上<br>6、单手、双手纵跳摸高：每组10次，3组以上<br>以上6个动作每周完成3-4次。";
adviceContent["sit_reach"]="1、站姿（坐姿）体前屈，每次保持15秒，做3组<br>2、坐姿广角伸展，每次保持15秒，做3组<br>3、前压腿，每次保持15秒，做3组<br>4、横叉，每次保持15秒，做3组<br>5、竖叉，每次保持15秒，做3组<br>以上五个动作坚持每天完成一次。";
adviceContent["50m_race"]="1、原地快速蹬地15秒*2组<br>2、原地快速高抬腿15-20秒*2组<br>3、行进间高抬腿20-30米*2组<br>4、行进间箭步走20-30米*2组<br>5、30米加速跑8*3组<br>6、50米跑*4组<br>7、60米跑*3组<br>8、三～四层楼跑楼梯*3组<br>9、30米双脚连续蛙跳*2组<br>10、徒手/负重深蹲（箭步跳）12次*3组";
adviceContent["long_race"]="1、坚持每天或隔天完成约1500米跑的量，可分3-4组完成<br>2、多练习200、300、400、600米规定时间内的跑，如男生每200米（学校操场跑一圈）不超过40秒，女生不超过45秒；400米跑男生不超过1分25秒，女生不超过1分35秒。<br>3、多跟着跑的较快的同学跑步，要有节奏的进行，每两步/三步一吸、每两步/三步一呼。给自己定下细的目标，如跑多少圈（米），多少时间内完成，形成自己跑步的好习惯，同时跑步姿态正确。";
adviceContent["pull_up"]="1、正、反手宽握/窄握引体向上3-5个一组，做3组以上<br>2、悬垂交替抓杠，利用单杠每次坚持30-50秒，做3组<br>3、杠铃/哑铃正握弯举，适合自身的重量，每次10个左右，做3组<br>4、杠铃/哑铃正握腕弯举，适合自身的重量，每次10个左右，做3组<br>5、杠铃/哑铃反握腕弯举，适合自身的重量，每次10个左右，做3组<br>6、负重旋内、旋外（各姿态均可）适合自身的重量，每次10个左右，做3组<br>7、站姿/坐姿对握哑铃推举，适合自身的重量，每次10个左右，做3组<br>8、弹力带Y-T-W-L肩膀训练，选用10-20磅的弹力带，各10次，做3组<br>9、杠铃/哑铃俯身划船，适合自身的重量，每次10个左右，做3组<br>10、哑铃单臂俯身划船，适合自身的重量，每次10个左右，做3组<br>11、坐姿划船，适合自身的重量，每次12个左右，做3组<br>12、俯卧两头起/小飞燕，每次12个，做3组<br>13、卷腹：12次一组，做2组<br>14、悬垂举腿，每次12个，做2组<br>15、正平板支撑：30~60秒一组，做2组<br>引体向上不是单个肌群完成的动作，完成引体向上用到的肌群包括以上练习，隔三天完成一次，如周一练习，到周四才可以进行第二次练习，以利于肌肉得到休息才能有效果。";
adviceContent["situp"]="1、标准动作：<br>预备姿势：仰卧，双手置于双耳两侧，大小腿夹角90度，脚掌平放于地面，平地上切勿把脚部固定（例如由同伴用手按着脚踝）。<br>动作路线：腹部用力抬起上半身，与地面约成45度，双脚贴紧地面，保持稳定。呼吸方式：抬起时呼气，下放时吸气。<hr>2、提高仰卧起坐练习动作与要求：<br>A、仰卧两头起，12次一组，做2组<br>B、卷腹：12次一组，做2组<br>C、仰卧举腿：12次一组，做2组（动作：双腿上抬成90度，下放不可接触地面）【条件允许可做悬垂举腿，每次12个，做2组】<br>D、正平板支撑：30秒一组，做2组<br>以上四个动作隔两天完成一次。";

function showExerciseAdvice(fieldName,name){
	if(fieldName=="height" || fieldName=="total_score") return;
	$("#fieldName").html("["+name+"]的练习建议");
	$("#adviceContent").html(adviceContent[fieldName]);
	$("#adviceModal").modal('show');
}
